use project0; 

insert into role values
(1,'admin'), (2,'student');

insert into user values 
('admin1','$2y$10$XSToN/nik1kRDv35LoapHOliPVu.4lYSADnqF3VAAt3vsjbc7Emxe',1),
('admin2','$2y$10$XSToN/nik1kRDv35LoapHOliPVu.4lYSADnqF3VAAt3vsjbc7Emxe',1),
('21370','$2y$10$RUojZR0m9ZRKoFDFH6L8i.TtrbeciMVxGUsDilbj6lrjfM3hol79G',2),
('21371','$2y$10$RUojZR0m9ZRKoFDFH6L8i.TtrbeciMVxGUsDilbj6lrjfM3hol79G',2),
('21372','$2y$10$RUojZR0m9ZRKoFDFH6L8i.TtrbeciMVxGUsDilbj6lrjfM3hol79G',2);

insert into faculty values
('FCST','Faculty of Computer Systems and Technologies'),
('FCS','Faculty of Computer Science'),
('FIS','Faculty of Information Science'),
('FC','Faculty of Computing'),
('DL','Department of Language'),
('DNS','Department of Natural Science'),
('DITSM','Department of Information Technology Supporting and Maintenance');

insert into semester values (1),(2),(3),(4),(5),(6),(7),(8),(9);

insert into qgroup values 
(1,"သင်ခန်းစာထိရောက်မှု၊ ဆရာ၊ဆရာမများသင်ကြားသည့်ပုံစံထိရောက်မှု"), 
(2,"ကျောင်းသားများလေ့လာသင်ကြားခြင်းထိရောက်မှု"), 
(3,"အထွေထွေသုံးသပ်ချက်");

insert into question (qgroup_id,question) values 
(1,"သင်ခန်းစာ၏ ပါ၀င်သည့်အကြောင်းအရာ၊ သင်ခန်းစာစီစဉ်ထားမှုနှင့် သင်ယူမှုလေ့ကျင့်ခန်းများသည် သင်ခန်းစာ၏ရည်ရွယ်ချက်များကို ထောက်ကူပေးသည်။"),
(1,"ဆရာ၊ဆရာမပြင်ဆင်ထားသောသင်ထောက်ကူပစ္စည်းများ (Power Point/ လိုအပ်သည့်စာရွက်စာတမ်းများ) သည် သင်ခန်းစာ၏ ဆိုလိုရင်းကို ကောင်းစွာသဘောပေါက် နားလည်နိုင်သည်။ "),
(1,"ဆရာ၊ဆရာမမှ ခက်ခဲသည့်အကြောင်းအရာများကို ဂရုတစိုက် ရှင်းပြသည်။"),
(1,"ဆရာ၊ဆရာမသည် ကျောင်းသူ၊ကျောင်းသားများ၏ လုပ်ဆောင်ချက်အပေါ်တွင် အကျိုးပြုသော/ကောင်းမွန်သော တုန့်ပြန်မှုကို ပေးပါသည်။"),
(1,"ဆရာ၊ဆရာမသည် ကျောင်းသား၊ ကျောင်းသူများအားအတန်းတွင် ပါ၀င်မှုကို အားပေးပါသည်။"),
(1,"ဆရာ၊ဆရာမသည် သက်ဆိုင်ရာဘာသာရပ်နှင့်ပါတ်သက်၍ လေးလေးနက်နက်စဉ်းစားရန် ကျောင်းသား၊ကျောင်းသူများအား တွန်းအားပေးပါသည်။ "),
(1,"ဆရာ၊ဆရာမသည် ကျောင်းသားက တောင်းဆိုသောအခါ အတန်းပြင်ပတွင်ရှင်းလင်းပြသပေးသည်။"),
(2,"ကျွန်တော်/ကျွန်မတို့သည် ဤအတန်းတွင် သင်ယူခြင်း၌ အကျိုးကျေးဇူးများစွာရှိသည်။ "),
(2,"သင်ကြားသောအကြောင်းအရာများသည် ဘာသာရပ်နှင့်ဆက်စပ်မှုရှိပါသည်။"),
(2,"စာမေးပွဲအစမ်းစစ်ဆေးခြင်းများနှင့်အခြားလိုအပ်သောလုပ်ဆောင်ချက်များသည် သင်ကြားသည့် အကြောင်းအရာနှင့်ဆက်စပ်မှုရှိပါသည်။ "),
(2,"အုပ်စုအဆင့်ခွဲခြားသတ်မှတ်ခြင်းများမှာ ရှင်းလင်းပြတ်သားမှုရှိပါသည်။"),
(2,"သင်ကြားရေးဆိုင်ရာကိစ္စရပ်များမှာ စိန်ခေါ်မှုတစ်ရပ်ဖြစ်ပါသည်။"),
(2,"သင်ခန်းစာ၏အဓိကဆိုလိုချက်များသည် နားလည်နိုင်မှုရှိသည်။"),
(3,"ခြုံငုံသုံးသပ်လျှင် ဆရာ၊ဆရာမ၏ကြိုးစားအားထုတ်မှုသည် ကျောင်းသား၊ ကျောင်းသူများအားအကျိုးရှိစေသည်။"),
(3,"ခြုံငုံသုံးသပ်လျှင် သင်ခန်းစာသည် ကျွန်တော်/ကျွန်မတို့အတွက် ဆက်လက်လေ့လာမှုအပေါ် အကျိုးရှိစေသည်။ "),
(3,"ဆရာ၊ဆရာမ၏ ထိရောက်စွာ သင်ကြားပြသမှု၊ဘာသာရပ်ဆိုင်ရာ ကျွမ်းကျင်မှုတို့ကြောင့် နောင် ဤဆရာ/ဆရာမ၏ အတန်းကို တက်ရောက်သင်ကြားလိုပါသည်။");
